app/controllers/notes_controller.rb

  def create
    @note = Note.new(note_params)

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("title", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello World"], ["status", 1], ["created_at", "2023-07-12 14:29:13.948540"], ["updated_at", "2023-07-12 14:29:13.948540"]]

  def update
    respond_to do |format|
      if @note.update(note_params)
---
UPDATE "notes" SET "title" = ?, "status" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", "Hello Worl"], ["status", 0], ["updated_at", "2023-07-12 18:17:24.740554"], ["id", 2]]

  def destroy
    @note.destroy
---
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 1]]

    def set_note
      @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]